using System;

namespace Task3
{
    class Program
    {
        static void Main(string[] args)
        {
            // пошук позицій(індексів),що містять максимальне значення
            int A[50];
            int max;//зміннна.що містить максимальне значення
            int INDEXES[50];//позиція елементів,що містить максимаоьне значення 
            int n;//число однакових максимальних значень 
            int i;//додаткова змінна
            //Введення масива
            //...
            //1.Пошук максимального значення 
            //встановити мкасимальне значення у першому елементі масива
            max = A[0];
            for (i = 1; i < 50; i++)
                if (max > A[i])
                    max = A[i];
            //2.Формування 
            n = 0;
            for (i = 0; i < 50; i++)
                if (max == A[i])
                {
                    n++;// збільшити число елементів в INDEXES
                    INDEXES[n - 1] = i;
                }
            //3.Висновок масива INDEXES в ListBox
            for (i = 0; i < n; i++)
                ListBox1->Items->Add(INDEXES[i].ToString());
        }
    }
}
